## Plan Result (test-dts_sharedservices_test-acme)




<pre><code>Plan: 2 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * module.acme.azurerm_role_assignment.Reader
  * module.acme.azurerm_role_assignment.kvaccess
* Update
  * module.acme.azurerm_application_insights.appinsight
  * module.acme.azurerm_key_vault.kv
  * module.acme.azurerm_resource_group.rg
  * module.acme.azurerm_service_plan.asp
  * module.acme.azurerm_storage_account.stg
  * module.acme.azurerm_windows_function_app.funcapp




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.acme.azurerm_application_insights.appinsight will be updated in-place
  ~ resource "azurerm_application_insights" "appinsight" {
        id                                    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/sds-platform-test-rg/providers/microsoft.insights/components/sds-platform-test"
        name                                  = "sds-platform-test"
      ~ tags                                  = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (4 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.acme.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/sds-platform-test-rg/providers/Microsoft.KeyVault/vaults/acmedtssdstest"
        name                            = "acmedtssdstest"
      ~ tags                            = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.acme.azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/sds-platform-test-rg"
        name     = "sds-platform-test-rg"
      ~ tags     = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.acme.azurerm_role_assignment.Reader will be created
  + resource "azurerm_role_assignment" "Reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "15b13511-596e-41a5-87ec-c9ea02eab459"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/sds-platform-test-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.acme.azurerm_role_assignment.kvaccess will be created
  + resource "azurerm_role_assignment" "kvaccess" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "15b13511-596e-41a5-87ec-c9ea02eab459"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/sds-platform-test-rg/providers/Microsoft.KeyVault/vaults/acmedtssdstest"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.acme.azurerm_service_plan.asp will be updated in-place
  ~ resource "azurerm_service_plan" "asp" {
        id                           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/sds-platform-test-rg/providers/Microsoft.Web/serverfarms/sds-platform-test-asp"
        name                         = "sds-platform-test-asp"
      ~ tags                         = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.acme.azurerm_storage_account.stg will be updated in-place
  ~ resource "azurerm_storage_account" "stg" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/sds-platform-test-rg/providers/Microsoft.Storage/storageAccounts/acmedtssdstest"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "acmedtssdstest"
      ~ tags                              = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (4 unchanged elements hidden)
        }
        # (34 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.acme.azurerm_windows_function_app.funcapp will be updated in-place
  ~ resource "azurerm_windows_function_app" "funcapp" {
      ~ app_settings                      = {
          ~ "Acmebot:AzureDns:SubscriptionId"            = "ed302caf-ec27-4c64-a05e-85731c3ce90e" -> "3eec5bde-7feb-4566-bfb6-805df6e10b90"
          + "FUNCTIONS_WORKER_RUNTIME"                   = "dotnet"
          + "WEBSITE_CONTENTAZUREFILECONNECTIONSTRING"   = (sensitive)
          + "WEBSITE_CONTENTSHARE"                       = "sds-platform-test"
          ~ "WEBSITE_RUN_FROM_PACKAGE"                   = "https://shibayan.blob.core.windows.net/azure-keyvault-letsencrypt/v3/latest.zip" -> "https://stacmebotprod.blob.core.windows.net/keyvault-acmebot/v4/latest.zip"
            # (5 unchanged elements hidden)
        }
      ~ client_certificate_mode           = "Required" -> "Optional"
      ~ functions_extension_version       = "~3" -> "~4"
        id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/sds-platform-test-rg/providers/Microsoft.Web/sites/acmedtssdstest"
        name                              = "acmedtssdstest"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ storage_account_access_key        = (sensitive value)
      + storage_key_vault_secret_id       = ""
      ~ tags                              = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (4 unchanged elements hidden)
        }
      + virtual_network_subnet_id         = ""
        # (20 unchanged attributes hidden)

      ~ site_config {
          + api_definition_url                     = ""
          + api_management_api_id                  = ""
          + app_command_line                       = ""
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ application_insights_connection_string = (sensitive value)
          - application_insights_key               = (sensitive value)
          ~ ftps_state                             = "AllAllowed" -> "Disabled"
          + health_check_path                      = ""
          + remote_debugging_version               = ""
          ~ scm_minimum_tls_version                = "1.0" -> "1.2"
          + windows_fx_version                     = ""
            # (21 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 6 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2,"Program":"tfcmt","SHA1":"","Target":"test-dts_sharedservices_test-acme","Vars":{}} -->